storage/app/step83-load-results/20260517-235031/baseline_auth_me.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/auth/me
Document Length:        736 bytes

Concurrency Level:      20
Time taken for tests:   2.652 seconds
Complete requests:      200
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      213183 bytes
HTML transferred:       147200 bytes
Requests per second:    75.42 [#/sec] (mean)
Time per request:       265.181 [ms] (mean)
Time per request:       13.259 [ms] (mean, across all concurrent requests)
Transfer rate:          78.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    46  250  57.3    250     402
Waiting:       44  249  57.3    250     401
Total:         46  250  57.1    250     402

Percentage of the requests served within a certain time (ms)
  50%    250
  66%    261
  75%    269
  80%    274
  90%    314
  95%    356
  98%    382
  99%    393
 100%    402 (longest request)