storage/app/step83-load-results/20260517-235031/baseline_health_dashboard.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/health/dashboard
Document Length:        1028 bytes

Concurrency Level:      20
Time taken for tests:   2.210 seconds
Complete requests:      200
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      271374 bytes
HTML transferred:       205600 bytes
Requests per second:    90.50 [#/sec] (mean)
Time per request:       221.005 [ms] (mean)
Time per request:       11.050 [ms] (mean, across all concurrent requests)
Transfer rate:          119.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       1
Processing:    34  208  46.2    209     330
Waiting:       33  208  46.2    209     330
Total:         34  208  46.1    209     330

Percentage of the requests served within a certain time (ms)
  50%    209
  66%    218
  75%    226
  80%    229
  90%    266
  95%    291
  98%    323
  99%    326
 100%    330 (longest request)