storage/app/step83-load-results/20260517-235031/baseline_health_steps.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/health/steps
Document Length:        73 bytes

Concurrency Level:      20
Time taken for tests:   2.289 seconds
Complete requests:      200
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      80382 bytes
HTML transferred:       14600 bytes
Requests per second:    87.39 [#/sec] (mean)
Time per request:       228.862 [ms] (mean)
Time per request:       11.443 [ms] (mean, across all concurrent requests)
Transfer rate:          34.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    36  216  56.5    211     376
Waiting:       35  216  56.5    211     376
Total:         36  217  56.4    211     376

Percentage of the requests served within a certain time (ms)
  50%    211
  66%    222
  75%    233
  80%    242
  90%    298
  95%    334
  98%    360
  99%    370
 100%    376 (longest request)