storage/app/step83-load-results/20260517-235031/smoke_auth_me.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/auth/me
Document Length:        736 bytes

Concurrency Level:      5
Time taken for tests:   0.678 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      53291 bytes
HTML transferred:       36800 bytes
Requests per second:    73.72 [#/sec] (mean)
Time per request:       67.825 [ms] (mean)
Time per request:       13.565 [ms] (mean, across all concurrent requests)
Transfer rate:          76.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    35   61  19.8     57     121
Waiting:       35   61  19.8     57     120
Total:         35   61  19.8     58     121

Percentage of the requests served within a certain time (ms)
  50%     58
  66%     66
  75%     73
  80%     77
  90%     93
  95%     98
  98%    121
  99%    121
 100%    121 (longest request)