storage/app/step83-load-results/20260517-235031/smoke_finance_accounts.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/finance/accounts
Document Length:        76 bytes

Concurrency Level:      5
Time taken for tests:   0.784 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      20250 bytes
HTML transferred:       3800 bytes
Requests per second:    63.77 [#/sec] (mean)
Time per request:       78.404 [ms] (mean)
Time per request:       15.681 [ms] (mean, across all concurrent requests)
Transfer rate:          25.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0      10
Processing:    21   75  35.7     67     153
Waiting:       20   74  35.6     67     153
Total:         21   75  35.9     67     153

Percentage of the requests served within a certain time (ms)
  50%     67
  66%     85
  75%    104
  80%    112
  90%    133
  95%    151
  98%    153
  99%    153
 100%    153 (longest request)