storage/app/step83-load-results/20260517-235031/smoke_health_ai_insights.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/health/ai-insights
Document Length:        404 bytes

Concurrency Level:      5
Time taken for tests:   1.080 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      36697 bytes
HTML transferred:       20200 bytes
Requests per second:    46.28 [#/sec] (mean)
Time per request:       108.049 [ms] (mean)
Time per request:       21.610 [ms] (mean, across all concurrent requests)
Transfer rate:          33.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    32  100  47.3     87     286
Waiting:       32   99  46.1     87     269
Total:         32  100  47.3     88     286

Percentage of the requests served within a certain time (ms)
  50%     88
  66%    103
  75%    126
  80%    131
  90%    157
  95%    185
  98%    286
  99%    286
 100%    286 (longest request)