storage/app/step83-load-results/20260517-235031/smoke_health_nutrition_summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/health/nutrition/summary
Document Length:        420 bytes

Concurrency Level:      5
Time taken for tests:   0.553 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      37452 bytes
HTML transferred:       21000 bytes
Requests per second:    90.43 [#/sec] (mean)
Time per request:       55.291 [ms] (mean)
Time per request:       11.058 [ms] (mean, across all concurrent requests)
Transfer rate:          66.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:    22   53  14.2     54      83
Waiting:       22   53  14.3     54      83
Total:         22   53  14.2     54      83

Percentage of the requests served within a certain time (ms)
  50%     54
  66%     57
  75%     62
  80%     67
  90%     72
  95%     79
  98%     83
  99%     83
 100%     83 (longest request)